---
kind: method
id: M:Autodesk.Revit.DB.ColorFillScheme.GetFormatOptions
source: html/74e725cd-a74e-5ac6-d01e-0d1022208eb1.htm
---
# Autodesk.Revit.DB.ColorFillScheme.GetFormatOptions Method

Returns the FormatOptions of the scheme.

## Syntax (C#)
```csharp
public FormatOptions GetFormatOptions()
```

## Remarks
This method will return the default FormatOptions if the scheme is by value.